app/Models/Admin/Node.php

    public function getAllNode() {
        return $this->orderBy('sort','DESC')->select()->get();
---
select * from `tp_Node` order by `sort` desc