app/Http/Controllers/Admin/UserController.php

select `name`, `id` from `tp_Role`
---
    public function index() {
        $RoleDB = new Role();

        $role = $RoleDB->pluck('name','id');// 1 => "超级管理员"